using System;
using System.Collections.Generic;

namespace Agebull.Common.Mvvm
{
    public class IconMap
    {
        public static Dictionary<string, string> map = new(StringComparer.OrdinalIgnoreCase)
        {
            {"向上","\uf062" },
            {"向下","\uf063" },
            {"分析","\uf0f1" },
            {"载入","\uf090" },
            {"载入子级","\uf019" },
            {"用户","\uf007" },
            {"查找","\uf002" },
            {"对","\uf00c" },
            {"错","\uf00c" },
            {"关闭","\uf011" },
            {"设置","\uf013" },
            {"刷新","\uf021" },
            {"新增","\uf055" },
            {"删除","\uf057" },
            {"通过","\uf058" },
            {"增加","\uf067" },
            {"减少","\uf068" },
            {"警告","\uf05a" },
            {"菜单","\uf009" },
            {"诊断","\uf0f0" },
            {"文件夹","\uf07c" },
            {"地球","\uf0ac" },
            {"本地","\uf21d" },
            {"文件","\uf0f6" },
            {"新文件","\uf016" },
            {"固定","\uf08d" },
            {"锁定","\uf023" },
            {"解锁","\uf13e" },
            {"清除","\uf1fc" },
            {"选中","\uf205" },
            {"未选中","\uf204" },
            {"清理","\uf1fc" },
            {"关联","\uf1e0" },
            {"插头","\uf1e6" },
            {"望远镜","\uf1e5" },
            {"数据库","\uf1c0" },
            {"计算器","\uf1ec" },
            {"敲定","\uf0e3" },
            {"断开","\uf127" },
            {"疑问","\uf128" },
            {"橡皮","\uf12d" },
            {"检查","\uf274" },
            {"代码","\uf1c9" },
            {"修复","\uf0d0" },
            {"索引","\uf160" },
            {"排序","\uf15d" },
            {"导入","\uf019" },
            {"时钟","\uf017" },
            {"规范","\uf046" },
            {"分类","\uf290" },
            {"视角","\uf0c0" },
            {"拆分","\uf0db" },

            {"扩散","\uf064" },
            {"全部","\uf0a3" },
            {"引用","\uf10d" },
            {"翻译","\uf1b0" },

            {"赞","\uf087" },
            {"差","\uf088" },
            {"公文包","\uf0b1" },
            {"编辑","\uf14b" },
            {"编辑成功","\uf14a" },
            {"运行","\uf04b" },
            {"暂停","\uf04c" },
            {"撤销","\uf0e2" },
            {"星号","\uf069" },
            {"保存","\uf0c7" },
            {"书签","\uf097" },
            {"切换","\uf0ec" },
            {"复制","\uf0c5" },
            {"粘贴","\uf0ea" },
            {"格式","\uf0ea" },
            {"取消","\uf00d" },
            {"完成","\uf00c" },
            {"更新","\uf01e" },
            {"修改","\uf040" },

            {"编辑器","\uf09d" },
            {"基本信息","\uf212" },
            {"代码生成","\uf121" },
            {"设计信息","\uf00b" },
            {"扩展信息","\uf18d" },
            {"属性表格","\uf06e" },
            {"跟踪信息","\uf120" },

            {"C#","\uf292" },
            {"CS","\uf292" },
            {"JS","\uf016" },
            {"CPP","\uf016" },
            {"SQL","\uf1c0" },


            {"Web","\uf26b" },
            {"API","\uf26b" },

            {"Word","\uf1c2" },
            {"Excel","\uf1c3" },
            {"PDF","\uf1c1" },
            {"图像","\uf1c5" },
            {"HTML","\uf1c9" },

            {"解决方案","\uf1b3" },
            {"项目","\uf1b2" },
            {"类别","\uf07c" },
            {"实体","\uf0ae" },
            {"模型","\uf02d" },
            {"命令","\uf09d" },
            {"字段","\uf016" },
            {"接口","\uf1e6" },
            {"枚举","\uf0cb" },
            {"UI","\uf022" },
            {"类型","\uf270" },


            {"普通列","\uf249" },
            {"主键列","\uf084" },
            {"外键列","\uf0c1" },
            {"链接列","\uf1e1" },
            {"接口列","\uf1e6" },
            {"计算列","\uf234" },
            {"数字列","\uf05a" },
            {"枚举列","\uf0cb" },
            {"时间列","\uf017" },
            {"图像列","\uf03e" },
            {"备注列","\uf10d" },
            {"布尔列","\uf205" },

            {"废弃状态","\uf05e" },
            {"删除状态","\uf014" },
            {"锁定状态","\uf023" },
            {"修改状态","\uf040" },
            {"警告状态","\uf06a" },
            {"正常状态","" },//\uf05d
        };

        public static IconMap Instance = new();

        public string this[string name]
        {
            get
            {
                if (name != null && map.TryGetValue(name, out var icon))
                    return icon;
                return "\uf005";
            }
        }
    }
}
